src/cf/src/AccumulationRegisters/ТоварыВНаличии/ТоварыВНаличии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВНаличии</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПартии</name>
    <comment>Реквизит для ускорения выборки по FIFO</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/CommonModules/ПартииИРазмещениеКлиент/Module.bsl
#Область ПрограммныйИнтерфейс

// Открывает форму выбора партии по остаткам регистра ТоварыВНаличии.
//
// Параметры:
//  ДатаОстатков - Дата, Граница, Неопределено - момент, на который считаются остатки.
//  ДанныеОтбора - Структура - свойства МестоХранения, Номенклатура, Характеристика.
//  Оповещение - ОписаниеОповещения, Неопределено - обработчик закрытия формы; если не задан,
//               выбранная партия записывается в ДанныеСтроки.Партия.
//  ДанныеСтроки - ДанныеФормыЭлементКоллекции, Структура, Неопределено - строка, в которую
//                 записывается выбранная партия при стандартном оповещении.
//
Процедура ВыбратьПартиюПоОстаткам(ДатаОстатков, ДанныеОтбора, Оповещение = Неопределено, ДанныеСтроки = Неопределено) Экспорт
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДатаОстатков", ДатаОстатков);
	ПараметрыФормы.Вставить("МестоХранения", ДанныеОтбора.МестоХранения);
	ПараметрыФормы.Вставить("Номенклатура", ДанныеОтбора.Номенклатура);
	ПараметрыФормы.Вставить("Характеристика", ДанныеОтбора.Характеристика);
	Если Оповещение = Неопределено Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораПартии", ПартииИРазмещениеКлиент, ДанныеСтроки);
	КонецЕсли;
	ОткрытьФорму("РегистрНакопления.ТоварыВНаличии.Форма.ВыборПартииПоОстаткам", ПараметрыФормы, , , , ,
		Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Записывает выбранную партию в строку после закрытия формы выбора.
//
// Параметры:
//  РезультатЗакрытия - Структура, Неопределено - свойства Партия и Количество.
//  ДанныеСтроки - ДанныеФормыЭлементКоллекции, Структура - строка со свойством Партия.
//
Процедура ПослеЗакрытияФормыВыбораПартии(РезультатЗакрытия, ДанныеСтроки) Экспорт
	Если РезультатЗакрытия = Неопределено Или ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДанныеСтроки.Партия = РезультатЗакрытия.Партия;
КонецПроцедуры

#КонецОбласти
